driver-tests/bpelse/assign/AssignJbi/src/jbiServiceUnits/AssignBpel/Assign/echoSum.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://stc.com/echoSum" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="echoSum" targetNamespace="http://stc.com/echoSum">
    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="http://stc.com/echoSum">
            <xsd:element name="item">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="value" type="xsd:int"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </types>
    <message name="echoSum">
        <part element="tns:item" name="part"/>
    </message>
    <portType name="echoSum">
        <operation name="echoSum">
            <input message="tns:echoSum"/>
            <output message="tns:echoSum"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:echoSum">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="echoSum">
            <soap:operation soapAction="echoSum"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="echoSumService">
        <port binding="tns:Binding" name="port">
            <soap:address location="http://localhost:${HttpDefaultPort}/echoSum"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="SLT">
        <plnk:role name="server" portType="tns:echoSum"/>
    </plnk:partnerLinkType>
</definitions>
